/*>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
* 文件名  ： intp
* 作者    ： zhengwei
* 版本    ： V0.0.1
* 时间    ： 2020/11/10
* 描述    ： 按键外部中断驱动程序
********************************************************************
* 副本
*
*>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>*/
/* 头文件 ----------------------------------------------------------------*/
#include "intp.h"                                                               
/* 宏定义 ----------------------------------------------------------------*/
/* 结构体或枚举 ----------------------------------------------------------*/
/* 内部函数声明-----------------------------------------------------------*/
/* 函数 ------------------------------------------------------------------*/
/*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
* 函数名  ： IntpInit
* 参数    ： void
* 返回    ： void
* 作者    ： zhengwei
* 时间    ： 2020/11/10
* 描述    ： 按键中断初始化   KEY1 P0_1    KEY2 P2_0
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*/
void IntpInit(void)
{
    //KEY1中断初始化
    //使能总中断
    EA = 1; // IEN0 |= 0x80;
    //使能组中断
    P0IE = 1; // IEN1 |= 0x20;
    //使能子中断
    P0IEN |= 0x02;
    //设置为下降沿触发中断
    PICTL |= 0x01;
    //KEY2中断初始化
    //使能总中断
    EA = 1; // IEN0 |= 0x80;
    //使能组中断
    P2IE = 1; // IEN2 |= 0x02;
    //使能子中断
    P2IEN |= 0x01;
    //设置为下降沿触发中断
    PICTL |= 0x08;
}
/*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
* 函数名  ： P0_ISR
* 参数    ： void
* 返回    ： void
* 作者    ： zhengwei
* 时间    ： 2020/11/10
* 描述    ： 按键1的中断服务程序
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*/
#pragma vector = P0INT_VECTOR
__interrupt void P0_ISR(void)
{
    //判断是否为KEY1 P0_1的引脚发生的中断
    if(POIFG & 0x02)
    {
        //消抖
        while(P0_1==1);
        delay(1200);
        if(KEY_PRESS == KeyStateGet(KEY_KEY1_E))
        {
            //LED1翻转
            LedToggle(LED_LED1_E);
        }
    }
    //消除状态标志
    P0IFG = 0;
    P0IF = 0;
}
/*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
* 函数名  ： P2_ISR
* 参数    ： void
* 返回    ： void
* 作者    ： zhengwei
* 时间    ： 2020/11/10
* 描述    ： 按键2的中断服务程序
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*/
#pragma vector = P2INT_VECTOR
__interrupt void P2_ISR(void)
{
     //判断是否为KEY2 P2_0的引脚发生的中断
    if(P2IFG & 0x01)
    {
        //消抖
        while(P2_0==1);
        delay(1200);
        if(KEY_PRESS == KeyStateGet(KEY_KEY2_E))
        {
            //LED2翻转
            LedToggle(LED_LED2_E);
        }
    }
    //消除状态标志
    P2IFG = 0;
    P2IF = 0;
}